# Выберите действие:
# 1. Добавить новый город
# 2. Отобразить список городов
# 3. Заменить город
# 4. Удалить город
# 5. Выход
#
# Ваше действие: 1
#
# Введите название города: Нью Йорк
# а .Город добавлен!
# б. Такой город уже есть! Нью Йорк - 3
# в. Некорректное название!
#
# Выберите действие:
# 1. Добавить новый город
# 2. Отобразить список городов
# 3. Заменить город
# 4. Удалить город
# 5. Посетить следующий город
# 6. Выход
#
# Ваше действие: 2
#
# Список городов:
# 1. Нью Йорк
#
# Выберите действие:
# 1. Добавить новый город
# 2. Отобразить список городов
# 3. Заменить город
# 4. Удалить город
# 5. Посетить следующий город
# 6. Выход
#
# Ваше действие: 3
#
# Текущий город: Нью Йорк
# Новый город: Нарын
# а. Текущий город отсутствует.
# б. Город заменен.
# в. Такой город уже есть! Нью Йорк - 3
# г. Некорректное название!
#
# Выберите действие:
# 1. Добавить новый город
# 2. Отобразить список городов
# 3. Заменить город
# 4. Удалить город
# 5. Посетить следующий город
# 6. Выход
#
# Ваше действие: 4
#
# Введите название города: Нарын
# а. Текущий город отсутствует.
# б. Некорректное название!
# в. Город удален!
#
# Выберите действие:
# 1. Добавить новый город
# 2. Отобразить список городов
# 3. Заменить город
# 4. Удалить город
# 5. Посетить следующий город
# 6. Выход
#
# Ваше действие: 5
# Программа завершает работу.