# Ввести число любой длины.
# Вывести на экран сумму его цифр.
a = '22814881337'
total = 0
for i in a:
    total += int(i)
print(total)