# a = [1, 2, 3, 4, 5]
# print(all(a))
######################################

# a = [1, False, 3, 4, 5]
# print(all(a))
######################################

# a = -123
# print(abs(a))
######################################

# a = [1, 2, 3, 0, -4]
# print(min(a))
######################################

# a = input()
# eval(a)
######################################

# a = [1, 2, 3, 4]
# print(*reversed(a))
######################################

# a = [1, 2, 3, 4]
# b = reversed(a)
# print(*b)
############################################################################
# ЭТО НЕ ИСПОЛЬЗОВАТЬ ЭТО НЕ ИСПОЛЬЗОВАТЬ ЭТО НЕ ИСПОЛЬЗОВАТЬ
# while True:
#     try:
#         a = int(input())
#         b = int(input())
#         c = input()
#     except:
#         print('Введите правильное число')
# ЭТО НЕ ИСПОЛЬЗОВАТЬ ЭТО НЕ ИСПОЛЬЗОВАТЬ ЭТО НЕ ИСПОЛЬЗОВАТЬ
############################################################################

#PROBLEM 1


























